chapter13/boxInBoxRefined-impact/constant/dynamicMeshDict-orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      blendedSixDoFMotionFvMesh;

blendedSixDoFMotionFvMeshCoeffs
{
	sixDoFMotionFunction	GLsixDoFMotion;

	GLsixDoFMotionCoeffs
	{
		bodyName	HULL;
		writeEachIter	true;
		eps		0.001;
		writeEachIter	true;

	}

}



// ************************************************************************* //
