chapter13/boxInBoxRefined-impact/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    REST
    {
        type            zeroGradient;
    }
    ZMAX
    {
        type            zeroGradient;

    }
    ZMIN 
    {
        type            fixedValue; 
        value           uniform (0 0 0);
    }
    HULL
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
        /*type            fixedValue; */
        /*value           uniform (0 0 0);*/
    }
}


// ************************************************************************* //
